Revit 2026 API

# CeramicPatternType Enumeration

---

The enumerated type representing the permitted values for the asset property "CeramicPattern" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CeramicPatternType
```
```vb
Public Enumeration CeramicPatternType
```
```cpp
public enum class CeramicPatternType
```
```fsharp
type CeramicPatternType
```

| Member name | Value | Description |
| --- | --- | --- |
| Custom | 1 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace